'''Дано типізований файл, який містить цілі числа. Визначити кількість парних
елементів, використавши динамічний масив для збереження елементів. Непарні елементи
зберегти у файлі «NP.dat», дотримуючись порядку їх слідування у даному типізованому
файлі.'''

with open('me') as f:
    s=0
    a= open('NP,dat.txt', 'w')
    f_odd = open('odd_nums.txt', 'w')
    for num in f:
        n = int(num)
        if n % 2 == 0:
            n=1
            s+=n
        else:
            a.write(str(n)+'\n')
    a.close()
    print(s)
