"""
Трикутник задається координатами своїх вершин на площині:А(х1,у1), В(х2,у2), С(х3,у3) . Визначити,
чи є цей трикутник виродженим.
"""
#0
#a1,2,3-перша координата вершин трикутника
#b1,2,3-друга координата верщин трикутника
a1=int(input('x1='))
b1=int(input('y1='))
a2=int(input('x2='))
b2=int(input('y2='))
a3=int(input('x3='))
b3=int(input('y3='))
if a1==a2==a3:
    print('трикутник є виродженим')
elif b1==b2==b3:
    print('трикутник вироджений')
else:
    print("трикутник не є виродженим")
